CSI API ETABS v1
cPropRebar.GetNameListWithData Method
 Retrieves the names and data of all defined rebar properties
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameListWithData(
	ref int NumberNames,
	ref string[] MyName,
	ref double[] Areas,
	ref double[] Diameters,
	ref string[] MyGUID
)
Function GetNameListWithData (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef Areas As Double(),
	ByRef Diameters As Double(),
	ByRef MyGUID As String()
) As Integer
Dim instance As cPropRebar
Dim NumberNames As Integer
Dim MyName As String()
Dim Areas As Double()
Dim Diameters As Double()
Dim MyGUID As String()
Dim returnValue As Integer
returnValue = instance.GetNameListWithData(NumberNames,
	MyName, Areas, Diameters, MyGUID)
int GetNameListWithData(
	int% NumberNames,
	array<String^>^% MyName,
	array<double>^% Areas,
	array<double>^% Diameters,
	array<String^>^% MyGUID
)
abstract GetNameListWithData :
        NumberNames : int byref *
        MyName : string[] byref *
        Areas : float[] byref *
        Diameters : float[] byref *
        MyGUID : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
 The numbe rof rebar properties
MyName
Type: System.String[]
 This is a one-dimensional array of rebar property names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the ETABS program, filled with the names, and returned to the API user.
Areas
Type: System.Double[]
Diameters
Type: System.Double[]
MyGUID
Type: System.String[]
 This is a one-dimensional array of rebar property GUIDs.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero
Remarks
See Also
Reference
cPropRebar Interface
ETABSv1 Namespace